###################################################################

# Created by write_sdc on Wed Jun  1 18:24:13 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_max_fanout 16 [current_design]
set_max_area 0
set_case_analysis 0 [get_ports scan_enable_i]
create_clock [get_ports clk_i]  -period 4  -waveform {0 2}
set_clock_latency 0.07  [get_clocks clk_i]
set_clock_uncertainty .08  [get_clocks clk_i]
set_max_transition 0.04 -clock_path [get_clocks clk_i]
create_clock -name vclk_i  -period 4  -waveform {0 2}
set_clock_latency 0.07  [get_clocks vclk_i]
set_max_transition 0.04 -clock_path [get_clocks vclk_i]
set_false_path   -from [list [get_ports tile_id_i_1_] [get_ports tile_id_i_0_]]
set_input_delay -clock clk_i  -max 0  [get_ports tile_id_i_1_]
set_input_delay -clock clk_i  -max 0  [get_ports tile_id_i_0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_i_rdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_i_rdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_i_rdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_i_rdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_wen_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_be__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_be__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_be__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_be__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_tgt_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_i_ini_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_wen_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_be__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_be__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_be__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_be__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_tgt_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_i_ini_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_wen_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_be__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_be__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_be__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_be__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_tgt_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_i_ini_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__meta_id__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__meta_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__meta_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__core_id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__core_id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__amo__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__amo__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__amo__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__amo__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wdata__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_wen_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_be__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_be__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_be__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_be__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__11_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__10_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__9_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__8_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__7_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__6_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__5_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__4_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__3_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__2_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__1_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_tgt_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_i_ini_addr__0_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_aw_ready_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_ar_ready_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_w_ready_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_b_valid_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_b__id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_b__id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_b__resp__1_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_b__resp__0_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_b__user_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r_valid_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__id__1_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__id__0_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__127_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__126_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__125_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__124_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__123_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__122_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__121_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__120_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__119_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__118_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__117_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__116_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__115_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__114_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__113_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__112_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__111_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__110_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__109_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__108_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__107_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__106_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__105_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__104_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__103_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__102_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__101_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__100_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__99_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__98_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__97_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__96_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__95_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__94_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__93_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__92_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__91_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__90_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__89_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__88_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__87_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__86_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__85_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__84_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__83_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__82_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__81_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__80_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__79_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__78_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__77_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__76_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__75_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__74_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__73_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__72_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__71_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__70_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__69_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__68_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__67_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__66_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__65_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__64_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__63_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__62_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__61_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__60_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__59_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__58_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__57_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__56_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__55_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__54_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__53_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__52_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__51_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__50_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__49_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__48_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__47_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__46_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__45_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__44_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__43_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__42_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__41_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__40_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__39_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__38_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__37_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__36_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__35_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__34_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__33_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__32_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__31_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__30_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__29_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__28_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__27_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__26_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__25_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__24_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__23_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__22_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__21_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__20_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__19_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__18_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__17_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__16_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__15_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__14_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__13_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__12_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__11_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__10_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__9_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__8_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__7_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__6_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__5_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__4_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__3_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__2_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__1_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__data__0_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__resp__1_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__resp__0_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__last_]
set_input_delay -clock clk_i  -max 0  [get_ports axi_mst_resp_i_r__user_]
set_input_delay -clock clk_i  -max 0  [get_ports wake_up_i_3_]
set_input_delay -clock clk_i  -max 0  [get_ports wake_up_i_2_]
set_input_delay -clock clk_i  -max 0  [get_ports wake_up_i_1_]
set_input_delay -clock clk_i  -max 0  [get_ports wake_up_i_0_]
set_input_delay -clock vclk_i  1.2  [get_ports rst_ni]
set_input_delay -clock clk_i  -max 0  [get_ports scan_enable_i]
set_input_delay -clock clk_i  -max 0  [get_ports scan_data_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_ready_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_ready_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_ready_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_ready_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_ready_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_ready_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_ready_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_valid_i]
set_input_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_ready_i]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_wen_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_be__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_be__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_be__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_be__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_o_tgt_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_wen_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_be__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_be__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_be__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_be__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_o_tgt_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_wen_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_be__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_be__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_be__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_be__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_o_tgt_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_wen_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_be__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_be__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_be__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_be__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_o_tgt_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_rdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_o_ini_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_rdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_o_ini_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_rdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_o_ini_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__meta_id__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__meta_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__meta_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__core_id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__core_id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__amo__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__amo__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__amo__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__amo__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_rdata__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_o_ini_addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__31_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__30_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__29_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__28_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__27_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__26_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__25_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__24_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__23_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__22_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__21_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__20_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__19_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__18_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__17_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__16_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__15_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__14_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__13_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__12_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__11_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__10_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__9_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__8_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__7_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__6_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__5_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__4_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__7_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__6_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__5_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__4_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__len__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__size__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__size__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__size__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__burst__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__burst__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__lock_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__cache__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__cache__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__cache__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__cache__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__prot__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__prot__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__prot__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__qos__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__qos__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__qos__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__qos__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__region__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__region__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__region__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__region__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__atop__5_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__atop__4_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__atop__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__atop__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__atop__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__atop__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw__user_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_aw_valid_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__127_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__126_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__125_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__124_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__123_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__122_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__121_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__120_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__119_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__118_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__117_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__116_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__115_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__114_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__113_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__112_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__111_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__110_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__109_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__108_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__107_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__106_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__105_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__104_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__103_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__102_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__101_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__100_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__99_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__98_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__97_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__96_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__95_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__94_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__93_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__92_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__91_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__90_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__89_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__88_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__87_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__86_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__85_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__84_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__83_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__82_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__81_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__80_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__79_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__78_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__77_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__76_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__75_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__74_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__73_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__72_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__71_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__70_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__69_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__68_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__67_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__66_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__65_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__64_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__63_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__62_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__61_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__60_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__59_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__58_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__57_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__56_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__55_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__54_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__53_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__52_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__51_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__50_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__49_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__48_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__47_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__46_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__45_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__44_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__43_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__42_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__41_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__40_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__39_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__38_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__37_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__36_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__35_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__34_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__33_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__32_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__31_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__30_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__29_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__28_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__27_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__26_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__25_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__24_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__23_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__22_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__21_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__20_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__19_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__18_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__17_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__16_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__15_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__14_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__13_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__12_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__11_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__10_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__9_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__8_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__7_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__6_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__5_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__4_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__data__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__15_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__14_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__13_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__12_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__11_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__10_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__9_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__8_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__7_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__6_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__5_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__4_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__strb__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__last_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w__user_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_w_valid_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_b_ready_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__id__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__id__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__31_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__30_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__29_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__28_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__27_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__26_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__25_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__24_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__23_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__22_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__21_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__20_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__19_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__18_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__17_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__16_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__15_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__14_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__13_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__12_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__11_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__10_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__9_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__8_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__7_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__6_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__5_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__4_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__addr__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__7_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__6_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__5_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__4_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__len__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__size__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__size__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__size__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__burst__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__burst__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__lock_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__cache__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__cache__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__cache__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__cache__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__prot__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__prot__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__prot__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__qos__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__qos__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__qos__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__qos__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__region__3_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__region__2_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__region__1_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__region__0_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar__user_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_ar_valid_]
set_output_delay -clock clk_i  -max 0  [get_ports axi_mst_req_o_r_ready_]
set_output_delay -clock clk_i  -max 0  [get_ports scan_data_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_req_valid_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_north_resp_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_req_valid_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_northeast_resp_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_req_valid_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_east_resp_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_req_valid_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_master_local_resp_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_req_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_north_resp_valid_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_req_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_northeast_resp_valid_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_req_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_east_resp_valid_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_req_ready_o]
set_output_delay -clock clk_i  -max 0  [get_ports tcdm_slave_local_resp_valid_o]
